Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Support for creating feeds directly from the ``deploy/*`` directories does not exist. Creating such feeds usually requires some kind of feed maintenance mechanism that would upload the new packages into an official package feed (e.g. the Ångström distribution). This functionality is highly distribution-specific and thus is not provided out of the box.
it_it: Non è previsto il supporto per la creazione di feed direttamente dalle directory ``deploy/*``. La creazione di tali feed richiede solitamente un meccanismo di gestione che carichi i nuovi pacchetti in un feed ufficiale (ad esempio, la distribuzione Ångström). Questa funzionalità è fortemente specifica per la distribuzione e pertanto non è disponibile di default.

source: Supported Linux Distributions
it_it: Distribuzioni Linux Supportate

source: Supporting a read-only root filesystem requires that the system and applications do not try to write to the root filesystem. You must configure all parts of the target system to write elsewhere, or to gracefully fail in the event of attempting to write to the root filesystem.
it_it: Il supporto di un filesystem root di sola lettura richiede che il sistema e le applicazioni non tentino di scrivere sul filesystem root. È necessario configurare tutte le parti del sistema di target in modo che scrivano altrove o che interrompano l'operazione in modo controllato qualora tentassero di scrivere sul filesystem root.

source: Suppose a CVE security issue impacts a software component. In that case, it can be fixed by updating to a newer version, by applying a patch, or by marking it as patched via :term:`CVE_STATUS` variable flag. For :term:`OpenEmbedded-Core (OE-Core)` master branches, updating to a more recent software component release with fixes is the best option, but patches can be applied if releases are not yet available.
it_it: Supponiamo che una vulnerabilità di sicurezza CVE interessi un componente software. In tal caso, è possibile risolverla aggiornando a una versione più recente, applicando una patch o contrassegnandola come "patched" tramite il flag della variabile :term:`CVE_STATUS`. Per i branch master di :term:`OpenEmbedded-Core (OE-Core)`, l'aggiornamento a una versione più recente del componente software con le correzioni è l'opzione migliore, ma è possibile applicare delle patch se le versioni non sono ancora disponibili.

source: Suppose you are using the ``linux-yocto_6.12.bb`` recipe to build the kernel. In other words, you have selected the kernel in your ``"bsp_root_name".conf`` file by adding :term:`PREFERRED_PROVIDER` and :term:`PREFERRED_VERSION` statements as follows::
it_it: Supponiamo di utilizzare la ricetta ``linux-yocto_6.12.bb`` per compilare il kernel. In altre parole, abbiamo selezionato il kernel nel file ``"bsp_root_name".conf`` aggiungendo le istruzioni :term:`PREFERRED_PROVIDER` e :term:`PREFERRED_VERSION` come di seguito::

source: Suppose, for security reasons, you need to disable your target device's root filesystem's write permissions (i.e. you need a read-only root filesystem). Or, perhaps you are running the device's operating system from a read-only storage device. For either case, you can customize your image for that behavior.
it_it: Supponiamo che, per motivi di sicurezza, sia necessario disabilitare i permessi di scrittura del filesystem root del dispositivo di target (ovvero, sia necessario un filesystem root di sola lettura). Oppure, si potrebbe eseguire il sistema operativo del dispositivo da un'unità di archiviazione di sola lettura. In entrambi i casi, è possibile personalizzare l'immagine per ottenere tale comportamento.

source: Sysprof Documentation
it_it: Documentazione di Sysprof

source: Sysprof Setup
it_it: Configurazione di Sysprof

source: Sysprof is a GUI-based application that runs on the target system. For the rest of this document we assume you're connected to the host through SSH and will be running Sysprof on the target (you can use the ``-X`` option to ``ssh`` and have the Sysprof GUI run on the target but display remotely on the host if you want).
it_it: Sysprof è un'applicazione con interfaccia grafica (GUI) che viene eseguita sul sistema target. Per il resto di questo documento, si presume che si sia connessi all'host tramite SSH e che si esegua Sysprof sul sistema target (è possibile utilizzare l'opzione ``-X`` per connettersi tramite ``ssh`` e far sì che l'interfaccia grafica di Sysprof venga eseguita sul sistema di destinazione, ma visualizzata in remoto sull'host, se lo si desidera).

source: Sysprof is an easy to use system-wide profiler that consists of a single window with three panes and a few buttons which allow you to start, stop, and view the profile from one place.
it_it: Sysprof è un profiler di sistema facile da usare, composto da un'unica finestra con tre riquadri e alcuni pulsanti che consentono di avviare, arrestare e visualizzare il profilo da un'unica posizione.

source: System Requirements
it_it: Requisiti di Sistema

source: System-Wide Tracing and Profiling
it_it: Tracing e Profilazione a Livello di Sistema

source: SystemTap Documentation
it_it: Documentazione di SystemTap

source: SystemTap Setup
it_it: Configurazione di SystemTap

source: SystemTap is a system-wide script-based tracing and profiling tool.
it_it: SystemTap è uno strumento di tracing e profiling a livello di sistema basato su script.

source: SystemTap scripts are C-like programs that are executed in the kernel to gather / print / aggregate data extracted from the context they end up being called under.
it_it: Gli script di SystemTap sono programmi simili al C che vengono eseguiti nel kernel per raccogliere/stampare/aggregare dati estratti dal contesto in cui vengono chiamati.

source: SystemTap, which uses ``crosstap``, assumes you can establish an SSH connection to the remote target. Please refer to the crosstap wiki page for details on verifying SSH connections. Also, the ability to SSH into the target system is not enabled by default in ``*-minimal`` images.
it_it: SystemTap, che utilizza ``crosstap``, presuppone che si possa stabilire una connessione SSH al target remoto. Per i dettagli sulla verifica delle connessioni SSH, consultare la pagina wiki di crosstap. Inoltre, la possibilità di connettersi tramite SSH al sistema target non è abilitata di default nelle immagini ``*-minimal``.

source: Systemd init manager testing
it_it: Test del gestore di init Systemd

source: Table of Contents
it_it: Sommario

source: Taking Patch Review into Account
it_it: Considerazioni sulla Revisione delle Patch

source: Tasks
it_it: I Task

source: Tasks should be ordered based on the order they generally execute. For commonly used tasks this would be:
it_it: I task devono essere ordinati in base all'ordine di esecuzione. Per i task di uso comune, l'ordine sarebbe:

source: Tasks such as :ref:`ref-tasks-configure`
it_it: Tasks come :ref:`ref-tasks-configure`

source: Team members can bring in domain experts as needed. Those people should be added to individual issues only and adhere to the same standards as the YP Security Team.
it_it: I membri del team possono coinvolgere esperti di dominio, se necessario. Tali esperti devono essere aggiunti solo a singoli problemi e attenersi agli stessi standard dell'YP Security Team.

source: Test Environment Manual
it_it: Manuale dell'Ambiente di Test

source: Test and/or use the Mysql integration with Toaster's Django web server. At this point, you can start up the normal Toaster Django web server with the Toaster database in Mysql. You can use this web server to confirm that the database migration and data population from the Layer Index is complete.
it_it: Testare e/o utilizzare l'integrazione MySQL con il server web Django di Toaster. A questo punto, si può avviare il normale server web Django di Toaster con il database di Toaster in MySQL. Si può utilizzare questo server web per verificare che la migrazione del database e il popolamento dei dati dall'indice del layer siano completi.

source: Test results can be submitted as part of the release process if desired.
it_it: I risultati dei test possono essere inviati come parte del processo di rilascio, se lo si desidera.

source: Test your changes
it_it: Verificare le modifiche

source: Testing and Quality Assurance
it_it: Test e Garanzia di Qualità

source: Testing within these public branches ensures in a publicly visible way that all of the main supposed architectures and recipes in OE-Core successfully build and behave properly.
it_it: I test all'interno di questi rami pubblici garantiscono, in modo visibile a tutti, che tutte le principali architetture e ricette previste in OE-Core vengano compilate e funzionino correttamente.

source: Testing would not be part of standard incoming change testing and regressions would not block incoming patches.
it_it: I test non faranno parte dei test standard delle modifiche in entrata e le regressioni non bloccheranno le patch in arrivo.

source: Thanks to Pseudo, the Yocto Project never needs root privileges to build images for your target system.
it_it: Grazie a Pseudo, Yocto Project non necessita mai di privilegi di root per creare immagini per il sistema target.

source: That append file would match any ``busybox_1.21.x.bb`` version of the recipe. So, the append file would match any of the following recipe names:
it_it: Questo file append corrisponderà a qualsiasi versione della ricetta ``busybox_1.21.x.bb``. Quindi, il file append corrisponderà a uno qualsiasi dei seguenti nomi di ricetta:

source: That in itself isn't very useful; after all, we can accomplish pretty much the same thing by just running ``perf script`` without arguments in the same directory as the ``perf.data`` file.
it_it: Questo di per sé non è molto utile; dopotutto, possiamo ottenere praticamente lo stesso risultato eseguendo ``perf script`` senza argomenti nella stessa directory del file ``perf.data``.

source: That will display the following dialog, which allows you to choose one or more events (or even entire subsystems) to trace:
it_it: Si aprirà la seguente finestra di dialogo, che consente di scegliere uno o più eventi (o anche interi sottosistemi) da tracciare:

source: The "OEBasicHash" :term:`BB_SIGNATURE_HANDLER` is the same as the "OEBasic" version but adds the task hash to the :ref:`stamp files <overview-manual/concepts:stamp files and the rerunning of tasks>`. This results in any metadata change that changes the task hash, automatically causing the task to be run again. This removes the need to bump :term:`PR` values, and changes to metadata automatically ripple across the build.
it_it: Il parametro "OEBasicHash" :term:`BB_SIGNATURE_HANDLER` è identico alla versione "OEBasic" ma aggiunge l'hash del task ai :ref:`file stamp <overview-manual/concepts:stamp files and the rerunning of tasks>`. Questo fa sì che qualsiasi modifica ai metadati che modifichi l'hash del task provochi automaticamente la nuova esecuzione del task stesso. In questo modo si elimina la necessità di incrementare i valori di :term:`PR` e le modifiche ai metadati si propagano automaticamente all'intera build.

source: The "pk" value must match the above respective BitBake version record.
it_it: Il valore "pk" deve corrispondere alla rispettiva versione di BitBake indicata sopra.

source: The 'pk' values in the example above should start at "1" and increment uniquely. You can use the same layer name in multiple releases.
it_it: I valori 'pk' nell'esempio precedente devono iniziare da "1" e incrementare in modo univoco. È possibile utilizzare lo stesso nome di layer in più release.

source: The 'trace events' Subsystem
it_it: Il sottosistema dei 'trace events'

source: The *output hash*, a new hash computed from the output of Shared State tasks, tasks that save their resulting output to a Shared State tarball. The mapping between the task hash and its output hash is reported to a new *Hash Equivalence* server. This mapping is stored in a database by the server for future reference.
it_it: L'*output hash*, un nuovo hash calcolato a partire dall'output dei task dello Shared State, ovvero i task che salvano il loro output risultante in un file tarball dello Shared State. La mappatura tra l'hash del task e il suo hash di output viene segnalata a un nuovo server di *Hash Equivalence*. Questa mappatura viene memorizzata in un database dal server per riferimenti futuri.

source: The *task hash* explained earlier: computed from the recipe metadata, the task code and the task hash values from its dependencies. When changes are made, these task hashes are therefore modified, causing the task to re-execute. The task hashes of tasks depending on this task are therefore modified too, causing the whole dependency chain to re-execute.
it_it: I *task hash*, spiegato in precedenza: calcolato a partire dai metadati della ricetta, dal codice del task e dai valori hash delle sue dipendenze. Quando vengono apportate modifiche, questi hash vengono quindi modificati, causando la riesecuzione del task. Di conseguenza, vengono modificati anche gli hash dei task che dipendono da questo task, causando la riesecuzione dell'intera catena di dipendenze.

source: The *unihash*, a new hash, initially set to the task hash for the task. This is used to track the *unicity* of task output, and we will explain how its value is maintained.
it_it: L'*unihash*, un nuovo hash, viene inizialmente impostato sull'hash del task. Questo viene utilizzato per tracciare l'*unicità* dell'output del task e spiegheremo come viene mantenuto il suo valore.

source: The :doc:`/bsp-manual/index` provides BSP-related development information. For specifics on development host preparation, see the ":ref:`bsp-manual/bsp:preparing your build host to work with bsp layers`" section in the Yocto Project Board Support Package (BSP) Developer's Guide.
it_it: Il :doc:`/bsp-manual/index` fornisce informazioni sullo sviluppo dei BSP. Per dettagli sulla preparazione dell'host di sviluppo, consultare la sezione ":ref:`bsp-manual/bsp:preparing your build host to work with bsp layers`" nella Guida dello Sviluppatore del Board Support Package (BSP) di Yocto Project.

source: The :doc:`/dev-manual/creating-fragments` section of the Yocto Project Development Tasks Manual for details on how to create new fragments in your build.
it_it: Consultare la sezione :doc:`/dev-manual/creating-fragments` del Manuale di Sviluppo dei Task di Yocto Project per i dettagli su come creare nuovi frammenti nella build.

source: The :doc:`/kernel-dev/index` provides kernel-related development information. For specifics on development host preparation, see the ":ref:`kernel-dev/common:preparing the build host to work on the kernel`" section in the Yocto Project Linux Kernel Development Manual.
it_it: Il :doc:`/kernel-dev/index` fornisce informazioni sullo sviluppo del kernel. Per dettagli sulla preparazione dell'host di sviluppo, consultare la sezione ":ref:`kernel-dev/common:preparing the build host to work on the kernel`" nel Manuale di Sviluppo del Kernel Linux di Yocto Project.

source: The :doc:`/ref-manual/fragments` section of the Yocto Project Reference Manual for a list of fragments the :term:`OpenEmbedded Build System` supports, and a quick reference guide on how to manage fragments.
it_it: La sezione :doc:`/ref-manual/fragments` del Manuale di Riferimento di Yocto Project per un elenco dei frammenti supportati da :term:`OpenEmbedded Build System` e una guida rapida su come gestire i frammenti.

source: The :manpage:`'perf probe' manual page <perf-probe(1)>`.
it_it: Il :manpage:`'perf probe' manual page <perf-probe(1)>`.

source: The :manpage:`'perf record' manual page <perf-record(1)>`.
it_it: Il :manpage:`'perf record' manual page <perf-record(1)>`.

source: The :manpage:`'perf report' manual page <perf-report(1)>`.
it_it: Il :manpage:`'perf report' manual page <perf-report(1)>`.

source: The :manpage:`'perf script' manual page <perf-script(1)>`.
it_it: Il :manpage:`'perf script' manual page <perf-script(1)>`.

source: The :manpage:`'perf stat' manual page <perf-stat(1)>`.
it_it: Il :manpage:`'perf stat' manual page <perf-stat(1)>`.

source: The :ref:`autotools* <ref-classes-autotools>` classes support packages built with the :wikipedia:`GNU Autotools <GNU_Autotools>`.
it_it: Le classi :ref:`autotools* <ref-classes-autotools>` supportano i pacchetti creati con :wikipedia:`GNU Autotools <GNU_Autotools>`.

source: The :ref:`ref-classes-allarch` class is inherited by recipes that do not produce architecture-specific output. The class disables functionality that is normally needed for recipes that produce executable binaries (such as building the cross-compiler and a C library as pre-requisites, and splitting out of debug symbols during packaging).
it_it: La classe :ref:`ref-classes-allarch` viene ereditata dalle ricette che non producono output specifici per un'architettura. Questa classe disabilita le funzionalità normalmente necessarie per le ricette che producono binari eseguibili (come la compilazione del cross-compilatore e di una libreria C come prerequisiti e la separazione dei simboli di debug durante la fase di packaging).

source: The :ref:`ref-classes-archiver` class supports releasing source code and other materials with the binaries.
it_it: La classe :ref:`ref-classes-archiver` supporta il rilascio del codice sorgente e di altri materiali insieme ai file binari.

source: The :ref:`ref-classes-barebox` class manages building the barebox bootloader.
it_it: La classe :ref:`ref-classes-barebox` gestisce la compilazione del bootloader barebox.

source: The :ref:`ref-classes-barebox` class supports config fragments and internally includes the :ref:`ref-classes-cml1` class to provide `Kconfig <https://docs.kernel.org/kbuild/kconfig-language.html>`__ support for barebox, enabling tasks such as :ref:`ref-tasks-menuconfig` and :ref:`ref-tasks-diffconfig`.
it_it: La classe :ref:`ref-classes-barebox` supporta i frammenti di configurazione e include internamente la classe :ref:`ref-classes-cml1` per fornire il supporto a `Kconfig <https://docs.kernel.org/kbuild/kconfig-language.html>`__ per barebox, abilitando i task come :ref:`ref-tasks-menuconfig` e :ref:`ref-tasks-diffconfig`.

source: The :ref:`ref-classes-sstate` class is a relatively generic implementation of how to "capture" a snapshot of a given task. The idea is that the build process does not care about the source of a task's output. Output could be freshly built or it could be downloaded and unpacked from somewhere. In other words, the build process does not need to worry about its origin.
it_it: La classe :ref:`ref-classes-sstate` è un'implementazione relativamente generica di come "catturare" un'istantanea di un determinato task. L'idea è che il processo di compilazione non si preoccupi della sorgente dell'output di un task. L'output potrebbe essere appena compilato oppure scaricato ed estratto da qualche altra parte. In altre parole, il processo di compilazione non deve preoccuparsi della sua origine.

source: The :ref:`ref-tasks-fetch` and :ref:`ref-tasks-unpack` tasks fetch the source files and unpack them into the :term:`Build Directory`.
it_it: I task :ref:`ref-tasks-fetch` e :ref:`ref-tasks-unpack` recuperano i file sorgente e li decomprimono nella :term:`Build Directory`.

source: The :ref:`ref-tasks-package` and :ref:`ref-tasks-packagedata` tasks combine to analyze the files found in the :term:`D` directory and split them into subsets based on available packages and files. Analysis involves the following as well as other items: splitting out debugging symbols, looking at shared library dependencies between packages, and looking at package relationships.
it_it: I task :ref:`ref-tasks-package` e :ref:`ref-tasks-packagedata` vengono utilizzati per analizzare i file presenti nella directory :term:`D` e suddividerli in sottoinsiemi in base ai pacchetti e ai file disponibili. L'analisi include, tra le altre cose, l'estrazione dei simboli di debug, l'esame delle dipendenze delle librerie condivise tra i pacchetti e l'analisi delle relazioni tra i pacchetti.

source: The :ref:`ref-tasks-package` task depends on the :ref:`ref-tasks-packagedata` task of each recipe in :term:`DEPENDS` through use of a ``[``\ :ref:`deptask <bitbake-user-manual/bitbake-user-manual-metadata:variable flags>`\ ``]`` declaration, which guarantees that the required shared-library / module-to-package mapping information will be available when needed as long as :term:`DEPENDS` has been correctly set.
it_it: Il task :ref:`ref-tasks-package` dipende dal task :ref:`ref-tasks-packagedata` di ogni ricetta in :term:`DEPENDS` tramite l'uso di una dichiarazione ``[``\ :ref:`deptask <bitbake-user-manual/bitbake-user-manual-metadata:variable flags>`\ ``]``, che garantisce che le informazioni di mappatura tra libreria condivisa/modulo e pacchetto richieste saranno disponibili quando necessario, purché :term:`DEPENDS` sia stato impostato correttamente.

source: The :ref:`ref-tasks-packagedata` task creates package metadata based on the analysis such that the build system can generate the final packages. The :ref:`ref-tasks-populate_sysroot` task stages (copies) a subset of the files installed by the :ref:`ref-tasks-install` task into the appropriate sysroot. Working, staged, and intermediate results of the analysis and package splitting process use several areas:
it_it: Il task :ref:`ref-tasks-packagedata` crea i metadati dei pacchetti in base all'analisi, in modo che il sistema di build possa generare i pacchetti finali. Il task :ref:`ref-tasks-populate_sysroot` predispone (copia) un sottoinsieme dei file installati dal task :ref:`ref-tasks-install` nella directory sysroot appropriata. I risultati di lavoro, di fase e intermedi del processo di analisi e suddivisione dei pacchetti utilizzano diverse aree:

source: The :ref:`ref-tasks-patch` task uses a recipe's :term:`SRC_URI` statements and the :term:`FILESPATH` variable to locate applicable patch files.
it_it: Il task :ref:`ref-tasks-patch` utilizza le istruzioni :term:`SRC_URI` di una ricetta e la variabile :term:`FILESPATH` per individuare i file di patch applicabili.

source: The :ref:`ref-tasks-populate_sdk_ext` task helps create the extensible SDK and handles host and target parts differently than its counterpart does for the standard SDK. For the extensible SDK, the task encapsulates the build system, which includes everything needed (host and target) for the SDK.
it_it: Il task :ref:`ref-tasks-populate_sdk_ext` contribuisce alla creazione dell'SDK estensibile e gestisce le parti host e target in modo diverso rispetto alla sua controparte per l'SDK standard. Per l'SDK estensibile, ik task incapsula il sistema di compilazione, che include tutto il necessario (host e target) per l'SDK.

source: The :ref:`ref-tasks-populate_sdk` task helps create the standard SDK and handles two parts: a target part and a host part. The target part is the part built for the target hardware and includes libraries and headers. The host part is the part of the SDK that runs on the :term:`SDKMACHINE`.
it_it: I task :ref:`ref-tasks-populate_sdk` contribuisce alla creazione dell'SDK standard e gestisce due parti: una parte target e una parte host. La parte target è quella compilata per l'hardware target e include librerie e file header. La parte host è la parte dell'SDK che viene eseguita su :term:`SDKMACHINE`.
